In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = Series([3, 6, 9, 12])

In [3]:
obj

0     3
1     6
2     9
3    12
dtype: int64

In [4]:
obj.values

array([ 3,  6,  9, 12])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
ww2_cas = Series([8700000, 4300000, 3000000, 2100000, 400000], index=['USSR', 'Germany', 'China', 'Japan', 'USA'])

In [7]:
ww2_cas

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
USA         400000
dtype: int64

In [8]:
ww2_cas['USA']

400000

In [9]:
ww2_cas[ww2_cas > 400000]

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
dtype: int64

In [10]:
ww2_cas > 400000

USSR        True
Germany     True
China       True
Japan       True
USA        False
dtype: bool

In [11]:
'USSR' in ww2_cas

True

In [12]:
ww2_dict = ww2_cas.to_dict()

In [13]:
ww2_dict

{'USSR': 8700000,
 'Germany': 4300000,
 'China': 3000000,
 'Japan': 2100000,
 'USA': 400000}

In [14]:
ww2_dict = ww2_cas.to_dict()

In [15]:
ww2_dict

{'USSR': 8700000,
 'Germany': 4300000,
 'China': 3000000,
 'Japan': 2100000,
 'USA': 400000}

In [16]:
ww2_Series = Series(ww2_dict)

In [17]:
countries = ['China', 'Germany', 'Japan', 'USA', 'USSR', 'Argentina']

In [18]:
obj2 = Series(ww2_dict, index=countries)

In [19]:
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
dtype: float64

In [20]:
pd.isnull(obj2)

China        False
Germany      False
Japan        False
USA          False
USSR         False
Argentina     True
dtype: bool

In [21]:
pd.notnull(obj2)

China         True
Germany       True
Japan         True
USA           True
USSR          True
Argentina    False
dtype: bool

In [22]:
ww2_Series

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
USA         400000
dtype: int64

In [23]:
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
dtype: float64

In [24]:
ww2_Series + obj2

Argentina           NaN
China         6000000.0
Germany       8600000.0
Japan         4200000.0
USA            800000.0
USSR         17400000.0
dtype: float64

In [25]:
obj2.name = u'第二次世界大戦の死傷者'

In [26]:
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
Name: 第二次世界大戦の死傷者, dtype: float64

In [27]:
obj2.index.name = 'Countries'

In [28]:
obj2

Countries
China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
Name: 第二次世界大戦の死傷者, dtype: float64

In [45]:
data = {'City': ['SF', 'LA', 'NYC'], 'Population': [837000, 3880000, 840000]}

In [46]:
data

{'City': ['SF', 'LA', 'NYC'], 'Population': [837000, 3880000, 840000]}

In [47]:
city_frame = DataFrame(data)

In [48]:
city_frame

  City  Population
0   SF      837000
1   LA     3880000
2  NYC      840000

In [53]:
my_ser = Series([1, 2, 3, 4], index=['A', 'B', 'C', 'D'])

In [54]:
my_ser

A    1
B    2
C    3
D    4
dtype: int64

In [56]:
my_index = my_ser.index

In [57]:
my_index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [58]:
my_index[0]

'A'

In [59]:
my_index[2:]

Index(['C', 'D'], dtype='object')

In [61]:
my_index[0] = 'Z'

TypeError: Index does not support mutable operations

In [62]:
from numpy.random import randn

In [63]:
ser1 = Series([1, 2, 3 , 4], index=['A', 'B', 'C', 'D'])

In [64]:
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [65]:
ser2 = ser1.reindex(['A', 'B', 'C', 'D', 'E', 'F'])

In [66]:
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [67]:
ser2.reindex(['A', 'B', 'C', 'D', 'E', 'F', 'G'], fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [68]:
ser3 = Series(['USA', 'Mexico', 'Canada'], index=[0, 5, 10])

In [69]:
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [70]:
# forward fill = ffill
ser3.reindex(range(15), method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [71]:
dframe = DataFrame(randn(25).reshape((5, 5)), index=['A', 'B', 'D', 'E', 'F'], columns=['col1', 'col2', 'col3', 'col4', 'col5'])

In [72]:
dframe

       col1      col2      col3      col4      col5
A  1.131884 -0.239448  0.281752  0.357018  0.615314
B  1.207614 -0.373195  0.648117 -0.335809  1.350827
D -0.566587  0.354993  1.722778 -0.077842  1.408145
E  0.429792  1.787918  0.424190  0.605949  0.755610
F  0.257359  0.587622 -0.310766 -0.413159  0.388648

In [73]:
new_index = ['A', 'B', 'C', 'D', 'E', 'F']
dframe2 = dframe.reindex(new_index)

In [74]:
dframe2

       col1      col2      col3      col4      col5
A  1.131884 -0.239448  0.281752  0.357018  0.615314
B  1.207614 -0.373195  0.648117 -0.335809  1.350827
C       NaN       NaN       NaN       NaN       NaN
D -0.566587  0.354993  1.722778 -0.077842  1.408145
E  0.429792  1.787918  0.424190  0.605949  0.755610
F  0.257359  0.587622 -0.310766 -0.413159  0.388648

In [75]:
new_columns = ['col1', 'col2', 'col3', 'col4', 'col5', 'col6']
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A  1.131884 -0.239448  0.281752  0.357018  0.615314   NaN
B  1.207614 -0.373195  0.648117 -0.335809  1.350827   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -0.566587  0.354993  1.722778 -0.077842  1.408145   NaN
E  0.429792  1.787918  0.424190  0.605949  0.755610   NaN
F  0.257359  0.587622 -0.310766 -0.413159  0.388648   NaN

In [76]:
dframe

       col1      col2      col3      col4      col5
A  1.131884 -0.239448  0.281752  0.357018  0.615314
B  1.207614 -0.373195  0.648117 -0.335809  1.350827
D -0.566587  0.354993  1.722778 -0.077842  1.408145
E  0.429792  1.787918  0.424190  0.605949  0.755610
F  0.257359  0.587622 -0.310766 -0.413159  0.388648

In [78]:
dframe.ix(new_index, new_columns)

/home/mjiuser01/anaconda3/envs/try_env/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

TypeError: __call__() takes from 1 to 2 positional arguments but 3 were given

In [79]:
dframe

       col1      col2      col3      col4      col5
A  1.131884 -0.239448  0.281752  0.357018  0.615314
B  1.207614 -0.373195  0.648117 -0.335809  1.350827
D -0.566587  0.354993  1.722778 -0.077842  1.408145
E  0.429792  1.787918  0.424190  0.605949  0.755610
F  0.257359  0.587622 -0.310766 -0.413159  0.388648

In [80]:
ser1 = Series(np.arange(3), index=['a', 'b', 'c'])

In [81]:
ser1

a    0
b    1
c    2
dtype: int64

In [82]:
ser1.drop('b')

a    0
c    2
dtype: int64

In [83]:
dframe1 = DataFrame(np.arange(9).reshape((3, 3)), index=['SF', 'LA', 'NY'], columns=['pop', 'size', 'year'])

In [84]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [91]:
dframe1.drop('LA', axis=0)

    pop  size  year
SF    0     1     2
NY    6     7     8

In [87]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [89]:
dframe1.drop('year', axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

In [90]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8